# lesson00　矩形選択
# 下の水平線で囲まれたコードをAtomの矩形選択機能を使って書いてください。

# ----------------------------------------------------------

family = ["nob", "kaz", "mari", "uchan"]

print("Hello! ")
print(family[0])
print(family[1])
print(family[2])
print(family[3])

# ----------------------------------------------------------

for one in family:
    print("Hello! {}".format(one))







# lesson01　移動と削除
# システム（UNIX）が持っているショートカットを使ってカーソルを移動してください。
# 　　⑴　カーソルを一文字分右に移動してください。   ⌃ + f => [f]oward
# 　　⑵　カーソルを一文字分左に移動してください。   ⌃ + b => [b]ack
# 　　⑶　カーソルを上（前）の行に移動してください。 ⌃ + p => [p]revious
# 　　⑷　カーソルを下（後）の行に移動してください。 ⌃ + n => [n]ext
# 　　⑸　カーソルを行頭に移動してください。        ⌃ + a => [a]head
# 　　⑹　カーソルを行末に移動してください。        ⌃ + e => [e]nd
# 　　⑺　カーソル右側の一文字を削除してください。   ⌃ + d => [d]elete
# 　　⑻　カーソル右側から行末までを削除ください。   ⌃ + k => [k(c)]ut

boy = """
親譲おやゆずりの無鉄砲むてっぽうで小供の時から損ばかりしている。小学校に居る時分学校の二階から飛び降りて一週間ほど腰こしを抜ぬかした事がある。なぜそんな無闇むやみをしたと聞く人があるかも知れぬ。別段深い理由でもない。新築の二階から首を出していたら、同級生の一人が冗談じょうだんに、いくら威張いばっても、そこから飛び降りる事は出来まい。弱虫やーい。と囃はやしたからである。小使こづかいに負ぶさって帰って来た時、おやじが大きな眼めをして二階ぐらいから飛び降りて腰を抜かす奴やつがあるかと云いったから、この次は抜かさずに飛んで見せますと答えた。
夏目漱石『坊ちゃん』から引用
"""

# lesson02　選択範囲を作る
# 任意のカーソル位置からAtomのキーボード・ショートカットを使って、
# カーソルを移動させたり、任意の選択範囲を作ってください。
# 　　⑴　ページの先頭まで選択してください。        ⌘ + ⇧ + ▲
# 　　⑵　ページの末尾まで選択してください。        ⌘ + ⇧ + ▼
# 　　⑶　行頭まで選択してください。              ⌘ + ⇧ ◀︎
# 　　⑷　行頭方向へ選択範囲を延ばしてください。    ⇧ + ◀︎
# 　　⑸　行末まで選択してください。              ⌘ + ⇧ + ▶︎ または ⌘ + l
# 　　⑹　行末方向へ選択範囲を延ばしてください。    ⇧ + ▶︎

print(boy)

text = """
　私わたくしはその人を常に先生と呼んでいた。だからここでもただ先生と書くだけで本名は打ち明けない。これは世間を憚はばかる遠慮というよりも、その方が私にとって自然だからである。私はその人の記憶を呼び起すごとに、すぐ「先生」といいたくなる。筆を執とっても心持は同じ事である。よそよそしい頭文字かしらもじなどはとても使う気にならない。
　私が先生と知り合いになったのは鎌倉かまくらである。その時私はまだ若々しい書生であった。暑中休暇を利用して海水浴に行った友達からぜひ来いという端書はがきを受け取ったので、私は多少の金を工面くめんして、出掛ける事にした。私は金の工面に二に、三日さんちを費やした。ところが私が鎌倉に着いて三日と経たたないうちに、私を呼び寄せた友達は、急に国元から帰れという電報を受け取った。電報には母が病気だからと断ってあったけれども友達はそれを信じなかった。友達はかねてから国元にいる親たちに勧すすまない結婚を強しいられていた。彼は現代の習慣┏┳┓からいうと結婚するにはあまり年が若過ぎた。それに肝心かんじんの当人が気に入らなかった。それで┣╋┫夏休みに当然帰るべきところを、わざと避けて東京の近くで遊んでいたのである。彼は電報を私に見せ┗┻┛てどうしようと相談をした。私にはどうしていいか分らなかった。けれども実際彼の母が病気であるとすれば彼は固もとより帰るべきはずであった。それで彼はとうとう帰る事になった。せっかく来た私は一人取り残された。
　学校の授業が始まるにはまだ大分だいぶ日数ひかずがあるので鎌倉におってもよし、帰ってもよいという境遇にいた私は、当分元の宿に留とまる覚悟をした。友達は中国のある資産家の息子むすこで金に不自由のない男であったけれども、学校が学校なのと年が年なので、生活の程度は私とそう変りもしなかった。したがって一人ひとりぼっちになった私は別に恰好かっこうな宿を探す面倒ももたなかったのである。
夏目漱石『こころ』から引用
"""
print(text)
